// arr=["Рома", "Катя", "Юля", "Илюша", "получили", "подарок", "не"]
// alert(arr[0] + arr[2] + arr[5] + arr[3] + arr[4])
// arr[7] = "Максим"
// alert(arr[7] + arr[6] + arr[2] + arr[5] + arr[3] + arr[4])

// obj = {"Коля" :"1000", "Рома" : "2000", "Юля": "5000"}
// alert(obj["Рома"])

// arr={
//     "Юля" : ["30000", "32000", "40000"],
//     "Рома" : ["10", "8", "6"]
// } alert(arr["Юля "] [0])

// arr={
//     "мальчики" : ["Илья", "Артем", "Рома", "Максим", "Тимофей", "Денис"],
//     "девочки" : ["Катя", "Вика", "Юля, ", "Соня", "Саша"]
// } 
// alert(arr["девочки"] [2] + arr["мальчики"] [5])

arr=[2,3,4,5]
for(arr = [2,3,4,5])